let DataName = {
  zcfzZmkName: [{ cols: ['--', '--'], name: "资产总计", children: [{ cols: ['--', '--'], name: "流动资产合计", ziChildren: [{ cols: ['--', '--'], name: "货币资金" }, { cols: ['--', '--'], name: "短期投资" }, { cols: ['--', '--'], name: "应收票据" }, { cols: ['--', '--'], name: "应收账款" }, { cols: ['--', '--'], name: "预付账款" }, { cols: ['--', '--'], name: "应收股利" }, { cols: ['--', '--'], name: "应收利息" }, { cols: ['--', '--'], name: "其他应收款" }, { cols: ['--', '--'], name: "存货" }, { cols: ['--', '--'], name: "其中：原材料" }, { cols: ['--', '--'], name: "在产品" }, { cols: ['--', '--'], name: "库存商品" }, { cols: ['--', '--'], name: "周转材料" }, { cols: ['--', '--'], name: "其他流动资产" }] }, { cols: ['--', '--'], name: "非流动资产合计", ziChildren: [{ cols: ['--', '--'], name: "长期债券投资" }, { cols: ['--', '--'], name: "长期股权投资" }, { cols: ['--', '--'], name: "固定资产原价" }, { cols: ['--', '--'], name: "减：累计折旧" }, { cols: ['--', '--'], name: "固定资产账面价值" }, { cols: ['--', '--'], name: "在建工程" }, { cols: ['--', '--'], name: "固定资产清理" }, { cols: ['--', '--'], name: "生产性生物资产" }, { cols: ['--', '--'], name: "无形资产" }, { cols: ['--', '--'], name: "开发支出" }, { cols: ['--', '--'], name: "长期待摊费用" }, { cols: ['--', '--'], name: "其他非流动资产" }] }] }, { cols: ['--', '--'], name: "负债合计", children: [{ cols: ['--', '--'], name: "流动负债合计", ziChildren: [{ cols: ['--', '--'], name: "短期借款" }, { cols: ['--', '--'], name: "应付票据" }, { cols: ['--', '--'], name: "应付账款" }, { cols: ['--', '--'], name: "预收帐款" }, { cols: ['--', '--'], name: "应付职工薪酬" }, { cols: ['--', '--'], name: "应交税费" }, { cols: ['--', '--'], name: "其他应付款" }, { cols: ['--', '--'], name: "其他流动负债" }] }, { cols: ['--', '--'], name: "非流动负债合计", ziChildren: [{ cols: ['--', '--'], name: "长期借款" }, { cols: ['--', '--'], name: "长期应付款" }, { cols: ['--', '--'], name: "递延收益" }, { cols: ['--', '--'], name: "其他非流动负债" }] }] }, { cols: ['--', '--'], name: "所有者权益(或股东权益)合计", children: [{ cols: ['--', '--'], name: "实收资本 (或股本)" }, { cols: ['--', '--'], name: "资本公积" }, { cols: ['--', '--'], name: "盈余公积" }, { cols: ['--', '--'], name: "未分配利润" }] }, { cols: ['--', '--'], name: "负债和所有者权益(或股东权益)总计" }],
  lrbZmkName: [
    { cols: ['--', '--'], name: "一、营业收入", children: [{ cols: ['--', '--'], name: "减：营业成本" }, { cols: ['--', '--'], name: "营业税金及附加", ziChildren: [{ cols: ['--', '--'], name: "其中：消费税" }, { cols: ['--', '--'], name: "营业税" }, { cols: ['--', '--'], name: "城市建设维护税" }, { cols: ['--', '--'], name: "资源税" }, { cols: ['--', '--'], name: "土地增值税" }, { cols: ['--', '--'], name: "城镇土地使用税、房产税、r车船税、印花税" }, { cols: ['--', '--'], name: "教育附加、矿产资源补偿费、排污费" }] }, { cols: ['--', '--'], name: "销售费用", ziChildren: [{ cols: ['--', '--'], name: "其中：商品维修费" }, { cols: ['--', '--'], name: "广告费和业务宣传费" }] }, { cols: ['--', '--'], name: "管理费用", ziChildren: [{ cols: ['--', '--'], name: "其中：开办费" }, { cols: ['--', '--'], name: "业务招待费" }, { cols: ['--', '--'], name: "研究费用" }] }, { cols: ['--', '--'], name: "财务费用", ziChildren: [{ cols: ['--', '--'], name: "其中：利息费用(收入以“-”号填列)" }, { cols: ['--', '--'], name: "加：投资收益(损失以“-”号填列)" }] }] }, { cols: ['--', '--'], name: "二、营业利润(亏损以“-”号填列)", children: [{ cols: ['--', '--'], name: "加：营业外收入", ziChildren: [{ cols: ['--', '--'], name: "其中：政府补助" }] }, { cols: ['--', '--'], name: "减：营业外支出", ziChildren: [{ cols: ['--', '--'], name: "其中：坏账损失" }, { cols: ['--', '--'], name: "无法收回的长期债券投资损失" }, { cols: ['--', '--'], name: "无法收回的长期股权投资损失" }, { cols: ['--', '--'], name: "自然灾害等不可抗力因素造成的损失" }, { cols: ['--', '--'], name: "税收滞纳金" }] }] }, { cols: ['--', '--'], name: "三、利润总额(亏损总额以“-”填列)", children: [{ cols: ['--', '--'], name: "减：所得税费用" }] }, { cols: ['--', '--'], name: "四、净利润(净亏损以“-”填列)" }],
  xjllZmkName: [{
    cols: ['--', '--'], name: "经营活动产生的现金流量净额", children: [{ cols: ['--', '--'], name: "销售产成品、商品、提供劳务收到的现金" }, { cols: ['--', '--'], name: "收到的其他与经营活动有关的现金" }, { cols: ['--', '--'], name: "购买原材料、商品、接受劳务支付的现金" }, { cols: ['--', '--'], name: "支付的职工薪酬" }, { cols: ['--', '--'], name: "支付的税费" }, { cols: ['--', '--'], name: "支付其他与经营活动有关的现金" }]
  }, { cols: ['--', '--'], name: "投资活动产生的现金流量净额", children: [{ cols: ['--', '--'], name: "收回短期投资、长期债券投资和长期股权投资收到的现金" }, { cols: ['--', '--'], name: "取得投资收益收到的现金" }, { cols: ['--', '--'], name: "处置固定资产、无形资产和其他非流动资产收回的现金净额" }, { cols: ['--', '--'], name: "短期投资、长期债券投资和长期股权投资支付的现金" }, { cols: ['--', '--'], name: "购建固定资产、无形资产和其他非流动资产支付的现金" }] }, { cols: ['--', '--'], name: "筹资活动产生的现金流量净额", children: [{ cols: ['--', '--'], name: "取得借款收到的现金" }, { cols: ['--', '--'], name: "吸收投资者投资收到的现金" }, { cols: ['--', '--'], name: "偿还借款本金支付的现金" }, { cols: ['--', '--'], name: "偿还借款利息支付的现金" }, { cols: ['--', '--'], name: "分配利润支付的现金" }] }, { cols: ['--', '--'], name: "四、现金净增加额", }, { cols: ['--', '--'], name: "加：期初现金余额", }, { cols: ['--', '--'], name: "五、期末现金余额", }],
  mxbZmkName: [
    { cols: ['--', '--'], name: "资产", kmlx: "1", children: [] },
    { cols: ['--', '--'], name: "负债", kmlx: "2", children: [] },
    { cols: ['--', '--'], name: "权益", kmlx: "3", children: [] },
    { cols: ['--', '--'], name: "损益", kmlx: "4", children: [] },
    { cols: ['--', '--'], name: "成本", kmlx: "5", children: [] }
  ]
}

let LaobanData = {
  zcfzZmkName: [{ cols: ['--', '--'], name: '货币资金' }, { cols: ['--', '--'], name: '应收账款' }, { cols: ['--', '--'], name: '应付账款' }, { cols: ['--', '--'], name: '应付职工薪酬' }, { cols: ['--', '--'], name: '应交税费' }, { cols: ['--', '--'], name: '实收资本 (或股本)' }, { cols: ['--', '--'], name: '未分配利润' }],
  lrbZmkName: [{ cols: ['--', '--'], name: '一、营业收入' }, { cols: ['--', '--'], name: '四、净利润(净亏损以“-”填列)' }]
}

let DataNssb = {
  list: [
    { szmc: "财务", kkMoney: '--' },
    { szmc: "社会保险基金收入", kkMoney: '--' },
    { szmc: "增值税", kkMoney: '--' },
    { szmc: "企业所得税", kkMoney: '--' },
    { szmc: "残疾人就业保障金", kkMoney: '--' },
    { szmc: "个人所得税", kkMoney: '--' },
    { szmc: "印花税", kkMoney: '--' },
    { szmc: "城市维护建设税", kkMoney: '--' },
  ],
  total: '--'
}

let DataInvoiceList = { //*发票清单 销项发票·进项发票·费用发票  数据
  xxfpData: { leng: '--', jshj: '--', sehj: '--' },
  jxfpData: { leng: '--', jshj: '--', sehj: '--' },
}
let DataWages = [
  { zwmc: '陆XX', sre: '--' }, { zwmc: '宋XX', sre: '--' }

]
module.exports = {
  DataName, LaobanData, DataNssb, DataInvoiceList, DataWages
};